load-test.yml
config:
  target: "http://localhost:3000" 
  phases:
    - duration: 60
      arrivalRate: 100 

scenarios:
  - name: "CRUD of Items in To-Do"
    flow:
      - post:
          url: "/items"
          json:
            name: "Load Test Task"
          capture:
            - json: "$.id"
              as: "taskId"

      - get:
          url: "/items"

      - put:
          url: "/items/{{ taskId }}"
          json:
            name: "Updated Load Test Task"
            completed: true

      - delete:
          url: "/items/{{ taskId }}"